[Survived] ObjectLiteral
cocofront/src/app/app-routing.module.ts:9:11
   { path: 'consumer', component: ConsumerComponent }
 ];
 
-@NgModule({
-  imports: [RouterModule.forRoot(routes)],
-  exports: [RouterModule]
-})
+@NgModule({})
 export class AppRoutingModule { }
 

[Survived] ArrayDeclaration
cocofront/src/app/app-routing.module.ts:10:12
 ];
 
 @NgModule({
-  imports: [RouterModule.forRoot(routes)],
+  imports: [],
   exports: [RouterModule]
 })
