[Survived] BlockStatement
src/app/consumer/consumer.component.spe.ts:5:37
 
 import { ConsumerComponent } from './consumer.component';
 
-describe('ConsumerComponent', () => {
-  let component: ConsumerComponent;
-  let fixture: ComponentFixture<ConsumerComponent>;
-
-  beforeEach(async(() => {
-    TestBed.configureTestingModule({
-      declarations: [ ConsumerComponent ]
-    })
-    .compileComponents();
-  }));
-
-  beforeEach(() => {
-    fixture = TestBed.createComponent(ConsumerComponent);
-    component = fixture.componentInstance;
-    fixture.detectChanges();
-  });
-
-  it('should create', () => {
-    expect(component).toBeTruthy();
-  });
-});
+describe('ConsumerComponent', () => {});
 

[Survived] StringLiteral
src/app/consumer/consumer.component.spe.ts:5:10
 
 import { ConsumerComponent } from './consumer.component';
 
-describe('ConsumerComponent', () => {
+describe("", () => {
   let component: ConsumerComponent;
   let fixture: ComponentFixture<ConsumerComponent>;

[Survived] BlockStatement
src/app/consumer/consumer.component.spe.ts:9:26
   let component: ConsumerComponent;
   let fixture: ComponentFixture<ConsumerComponent>;
 
-  beforeEach(async(() => {
-    TestBed.configureTestingModule({
-      declarations: [ ConsumerComponent ]
-    })
-    .compileComponents();
-  }));
+  beforeEach(async(() => {}));
 
   beforeEach(() => {

[Survived] ArrayDeclaration
src/app/consumer/consumer.component.spe.ts:11:21
 
   beforeEach(async(() => {
     TestBed.configureTestingModule({
-      declarations: [ ConsumerComponent ]
+      declarations: []
     })
     .compileComponents();

[Survived] BlockStatement
src/app/consumer/consumer.component.spe.ts:16:20
     .compileComponents();
   }));
 
-  beforeEach(() => {
-    fixture = TestBed.createComponent(ConsumerComponent);
-    component = fixture.componentInstance;
-    fixture.detectChanges();
-  });
+  beforeEach(() => {});
 
   it('should create', () => {

[Survived] BlockStatement
src/app/consumer/consumer.component.spe.ts:22:29
     fixture.detectChanges();
   });
 
-  it('should create', () => {
-    expect(component).toBeTruthy();
-  });
+  it('should create', () => {});
 });
 
