[Survived] StringLiteral
src/app/consumer/consumer.component.ts:6:16
 
 @Component({
   selector: 'app-consumer',
-  templateUrl: './consumer.component.html',
+  templateUrl: "",
   styleUrls: ['./consumer.component.scss']
 })

[Survived] ArrayDeclaration
src/app/consumer/consumer.component.ts:10:18
   styleUrls: ['./consumer.component.scss']
 })
 export class ConsumerComponent implements OnInit {
-  users: any[] = [];
+  users: any[] = ["Stryker was here"];
 
  constructor(

[Survived] BlockStatement
src/app/consumer/consumer.component.ts:17:14
     ) {
     }
 
-  ngOnInit() {
-      this.userService.getUsers() .subscribe(
-        (data) => { // Success
-          this.users = data['results'];
-        },
-        (error) => {
-          console.error(error);
-        }
-      );
-    }
+  ngOnInit() {}
 
 }

[Survived] BlockStatement
src/app/consumer/consumer.component.ts:19:19
 
   ngOnInit() {
       this.userService.getUsers() .subscribe(
-        (data) => { // Success
-          this.users = data['results'];
-        },
+        (data) => {},
         (error) => {
           console.error(error);

[Survived] StringLiteral
src/app/consumer/consumer.component.ts:20:29
   ngOnInit() {
       this.userService.getUsers() .subscribe(
         (data) => { // Success
-          this.users = data['results'];
+          this.users = data[""];
         },
         (error) => {

[Survived] BlockStatement
src/app/consumer/consumer.component.ts:22:20
         (data) => { // Success
           this.users = data['results'];
         },
-        (error) => {
-          console.error(error);
-        }
+        (error) => {}
       );
     }
