[Survived] BlockStatement
cocofront/src/app/user.service.spe.ts:4:31
 import { TestBed } from '@angular/core/testing';
 import { UserService } from './user.service';
 
-describe('UserService', () => {
-  beforeEach(() => TestBed.configureTestingModule({}));
-
-  it('should be created', () => {
-    const service: UserService = TestBed.get(UserService);
-    expect(service).toBeTruthy();
-  });
-});
+describe('UserService', () => {});
 

[Survived] ArrowFunction
cocofront/src/app/user.service.spe.ts:5:14
 import { UserService } from './user.service';
 
 describe('UserService', () => {
-  beforeEach(() => TestBed.configureTestingModule({}));
+  beforeEach(() => undefined);
 
   it('should be created', () => {

[Survived] BlockStatement
cocofront/src/app/user.service.spe.ts:7:33
 describe('UserService', () => {
   beforeEach(() => TestBed.configureTestingModule({}));
 
-  it('should be created', () => {
-    const service: UserService = TestBed.get(UserService);
-    expect(service).toBeTruthy();
-  });
+  it('should be created', () => {});
 });
 
