[Survived] BlockStatement
cocofront/src/app/user.service.ts:11:14
 
   constructor(protected http: HttpClient) { }
 
-  getUsers() {
-      return this.http.get('https://randomuser.me/api/?results=5');
-  }
+  getUsers() {}
 }
 

[Survived] StringLiteral
cocofront/src/app/user.service.ts:12:28
   constructor(protected http: HttpClient) { }
 
   getUsers() {
-      return this.http.get('https://randomuser.me/api/?results=5');
+      return this.http.get("");
   }
 }
